# 1) 1-დან 100-მდე დაითვალეთ ხუთის ჯერადი რიცხვების ჯამი
# 2) 1 დან 100 მდე დაბეჭდეთ ყოველი ლუწი რიცხვი და მიუწერეთ მათ რომ ლუწია,
# შემდეგ 1 და 100 მდე დაბეჭდეთ ყოველი კენტი რიცხვი და მიუწერეთ რომ კენტია, გამოიყენეთ მხოლოდ ლუპი
# 3) 1-დან 100-მდე დაითვალეთ ხუთის ჯერადი რიცხვების ჯამი გამოიყენეთ if, else გამოგადგებათ % ნიშანი
# 1
sum=0
for i in range(1, 100 , 5):
    sum= sum + i
print(sum)
# 2
sum1 = 0
for o in range(1,100,2):
    sum1=sum1+i
sum3=0
for i in range (1,100,3):
    sum3=sum3+i

print(sum1 + sum3)
