# 1) შექმენით კალკულატორის ფუნქცია რომელსაც ექნება სამი პარამეტრი პ
# ირველი რიცხვი, მეორე რიცხვი და მოქმედება თუ რა მოქმედებ
# ა უნდა რომ შესრულდეს ამ ორ რიცხვს შორის რიცხვებიდან
#  და მათემატიკური ოპერატორიდან გამომდინარე 
# დაგიბრუნოთ პასუხი, თუ მაგალითად მომხმარებელამ 
# შემოიტანა 5 და 10 ხოლო მას უნდა ამ ორი რიცხვის
#  დამატება ანუ მესამე პარამეტრი არის "+" პლიუსი ეს ორი რიცხვი შეიკრიბოს 5 + 10 = 15
num1= int(input("enter num1 :"))
num2= int(input("enter num2 :"))
calc = input("choose one (+ - *) :")
def p ():
    print(num1 + num2)
def g ():
    print(num1 * num2)
def m ():
    print(num1 - num2)
if calc == "+" :
    p()
elif calc == "-" :
    m()
elif calc == "*" :
    g()
else :
    print("EROR")